nce3-2/L35.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-21 Sat 10:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org1530026" class="outline-2">
<h2 id="org1530026">L35 Justice was done</h2>
<div class="outline-text-2" id="text-org1530026">
<p class="verse">
The word 'justice' is given two different meanings in the text.<br />
What is the distinction between them?<br />
<br />
The word justice is usually associated with courts of law.<br />
We might say that justice has been done<br />
&#xa0;when a man's innocence or guilt has been proved beyond doubt.<br />
Justice is part of the complex machinery of the law.<br />
Those who seek it undertake an arduous journey<br />
&#xa0;and can never be sure that they will find it.<br />
Judges, however wise or eminent, are human and can make mistakes.<br />
<br />
There are rare instances when justice almost ceases to be an abstract concept.<br />
Reward or punishment are meted out quite independent of human interference.<br />
At such times, justice acts like a living force.<br />
When we use a phrase like 'it serves him right', we are, in part,<br />
&#xa0;admitting that a certain set of circumstances has enabled justice to act of its own accord.<br />
<br />
When a thief was caught on the premises of a large jewellery store one morning,<br />
&#xa0;the shop assistants must have found it<br />
&#xa0;&#xa0;impossible to resist the temptation to 'it serves him right.'<br />
The shop was an old converted house with many large, disused fireplaces and tall, narrow chimneys.<br />
Towards midday, a girl heard a muffled cry coming from behind one of the walls.<br />
As the cry was repeated several times, she ran to tell the manager<br />
&#xa0;who promptly rang up the fire brigade.<br />
The cry had certainly come from one of the chimneys,<br />
&#xa0;but as there were so many of them,<br />
&#xa0;the fire fighters could not be certain which one it was.<br />
They located the right chimney by tapping at the walls and listening for the man's cries.<br />
After chipping through a wall which was eighteen inches thick,<br />
&#xa0;they found that a man had been eventually able to free him by cutting a huge hole in the wall.<br />
The sorry-looking, blackened figure that emerged, admitted at once<br />
&#xa0;that he had tried to break into the shop during the night<br />
&#xa0;&#xa0;but had got stuck in the chimney.<br />
He had been there for nearly ten hours.<br />
Justice had been done even before the man was handed over to the police.<br />
</p>
</div>

<div id="outline-container-orgbbc1f52" class="outline-3">
<h3 id="orgbbc1f52">words</h3>
<div class="outline-text-3" id="text-orgbbc1f52">
<p>
justice [ˈdʒʌstɪs] n.正义,公正;司法<br />
court [kɔːrt] n.法院<br />
law [lɔː] n.法律<br />
innocence [ˈɪnəsns] n.无辜<br />
undertake [ˌʌndərˈteɪk] v.承担;着手做<br />
arduous [ˈɑːrdʒuəs] adj.艰苦的<br />
abstract [ˈæbstrækt] adj.抽象的<br />
concept [ˈkɑːnsept] n.概念,观念<br />
mete [miːt] out 给予,处置<br />
interference [ˌɪntərˈfɪrəns] n.干涉<br />
accord [əˈkɔːrd] n.一致<br />
premises [ˈpremɪsɪz] n.房屋<br />
convert [kənˈvɜːrt] v.转变,改变<br />
disused [ˌdɪsˈjuːzd] adj.不再用的,废弃的<br />
fireplace [ˈfaɪərpleɪs] n.璧炉<br />
muffle [ˈmʌf(ə)l] v.捂住,厌抑<br />
chip [tʃɪp] v.砍<br />
blacken [ˈblækən] v.使变黑<br />
emerge [ɪˈmɜːrdʒ] v.(从某处)出现<br />
</p>
</div>
</div>
</div>
</div>
</body>
</html>
